ANSSI-FR/SecAESSTM32/src/stm32discovery_F407/stm32f4xx_scb.h
#ifndef _STM32F4XX_SCB_H
#define _STM32F4XX_SCB_H
#include "helpers.h"

#include "stm32f4xx_core.h"

/* System control block design hints and tips
 * Ensure software uses aligned accesses of the correct size to access the system control block registers:
 * • except for the CFSR and SHPR1-SHPR3, it must use aligned word accesses
 * • for the CFSR and SHPR1-SHPR3 it can use byte or aligned halfword or word accesses.
 *
 * The processor does not support unaligned accesses to system control block registers
 *
 * In a fault handler.
 *
 * to determine the true faulting address:
 *  1. Read and save the MMFAR or BFAR value.
 *  2. Read the MMARVALID bit in the MMFSR, or the BFARVALID bit in the BFSR.
 *
 *  The MMFAR or BFAR address is valid only if this bit is 1.
 *  Software must follow this sequence because another higher priority exception might change
 *  the MMFAR or BFAR value. For example, if a higher priority handler preempts the current
 *  fault handler, the other fault might change the MMFAR or BFAR value.
 */

/* SCB Registers */
#define r_CORTEX_M_SCB_ACTLR                REG_ADDR(SCS_BASE + (uint32_t) 0x08)               /* (R/W)  Auxiliary control register */

#define r_CORTEX_M_SCB				        REG_ADDR(SCB_BASE + (uint32_t) 0x00)
#define r_CORTEX_M_SCB_CPUID                REG_ADDR(SCB_BASE + (uint32_t) 0x00)               /* (R/ )  CPUID Base Register */
#define r_CORTEX_M_SCB_ICSR                 REG_ADDR(SCB_BASE + (uint32_t) 0x04)               /* (R/W)  Interrupt Control and State Register */
#define r_CORTEX_M_SCB_VTOR                 REG_ADDR(SCB_BASE + (uint32_t) 0x08)               /* (R/W)  Vector Table Offset Register */
#define r_CORTEX_M_SCB_AIRCR                REG_ADDR(SCB_BASE + (uint32_t) 0x0C)               /* (R/W)  Application Interrupt and Reset Control Register */
#define r_CORTEX_M_SCB_SCR                  REG_ADDR(SCB_BASE + (uint32_t) 0x10)               /* (R/W)  System Control Register */
#define r_CORTEX_M_SCB_CCR                  REG_ADDR(SCB_BASE + (uint32_t) 0x14)               /* (R/W)  Configuration Control Register */

#define r_CORTEX_M_SCB_SHPR1                REG_ADDR(SCB_BASE + (uint32_t) 0x18)               /* (R/W)  System Handlers Priority Registers (4-6) */
#define r_CORTEX_M_SCB_SHPR2                REG_ADDR(SCB_BASE + (uint32_t) 0x1C)               /* (R/W)  System Handlers Priority Registers (11) */
#define r_CORTEX_M_SCB_SHPR3                REG_ADDR(SCB_BASE + (uint32_t) 0x20)               /* (R/W)  System Handlers Priority Registers (14-15) */

#define r_CORTEX_M_SCB_SHCSR                REG_ADDR(SCB_BASE + (uint32_t) 0x24)               /* (R/W)  System Handler Control and State Register */

#define r_CORTEX_M_SCB_CFSR                 REG_ADDR(SCB_BASE + (uint32_t) 0x28)               /* (R/W)  Configurable Fault Status Register  */
#define r_CORTEX_M_SCB_MMSR                 REG_ADDR(SCB_BASE + (uint32_t) 0x28)               /* (R/W)  MemManage Fault Address Register (A subregister of the CFSR)*/
#define r_CORTEX_M_SCB_BFSR                 REG_ADDR(SCB_BASE + (uint32_t) 0x29)               /* (R/W)  BusFault Status Register  */
#define r_CORTEX_M_SCB_UFSR                 REG_ADDR(SCB_BASE + (uint32_t) 0x2a)               /* (R/W)  UsageFault Status Register  */

#define r_CORTEX_M_SCB_HFSR                 REG_ADDR(SCB_BASE + (uint32_t) 0x2c)               /* (R/W)  Hard fault status register  */
#define r_CORTEX_M_SCB_MMFAR                REG_ADDR(SCB_BASE + (uint32_t) 0x34)               /* (R/W)  Memory management fault address register */
#define r_CORTEX_M_SCB_BFAR                 REG_ADDR(SCB_BASE + (uint32_t) 0x38)               /* (R/W)  Bus fault address register (BFAR) */
#define r_CORTEX_M_SCB_AFSR                 REG_ADDR(SCB_BASE + (uint32_t) 0x3c)               /* (R/W)  Auxiliary fault status register */

#define r_CORTEX_M_SCB_CPACR                REG_ADDR(SCB_BASE + (uint32_t) 0x88)               /* (R/W)  Coprocessor Access Control register */

/* Auxiliary control register Définitions */
#define SCB_ACTLR_DISOOFP_Pos               9                                         /* Bit 9 DISOOFP  */
#define SCB_ACTLR_DISOOFP_Msk               ((uint32_t) 0x01 << SCB_ACTLR_DISOOFP_Pos)
#define SCB_ACTLR_DISFPCA_Pos               8                                         /* Bit 8 DISFPCA  */
#define SCB_ACTLR_DISFPCA_Msk               ((uint32_t) 0x01 << SCB_ACTLR_DISFPCA_Pos)
#define SCB_ACTLR_DISFOLD_Pos               2                                         /* Bit 2 DISFOLD  */
#define SCB_ACTLR_DISFOLD_Msk               ((uint32_t) 0x01 << SCB_ACTLR_DISFOLD_Pos)
#define SCB_ACTLR_DISDEFWBUF_Pos            1                                         /* Bit 1 DISDEFWBUF   */
#define SCB_ACTLR_DISDEFWBUF_Msk            ((uint32_t) 0x01 << SCB_ACTLR_DISDEFWBUF_Pos)
#define SCB_ACTLR_DISMCYCINT_Pos            0                                         /* Bit 0 DISMCYCINT   */
#define SCB_ACTLR_DISMCYCINT_Msk            ((uint32_t) 0x01 << SCB_ACTLR_DISMCYCINT_Pos)


/* SCB CPUID Register Definitions */
#define SCB_CPUID_IMPLEMENTER_Pos          24                                         /* Bits 31:24 IMPLEMENTER Position */
#define SCB_CPUID_IMPLEMENTER_Msk          ((uint32_t) 0x00ff << SCB_CPUID_IMPLEMENTER_Pos)

#define SCB_CPUID_VARIANT_Pos              20                                         /* Bits 23:20 VARIANT Position */
#define SCB_CPUID_VARIANT_Msk              ((uint32_t) 0x000f << SCB_CPUID_VARIANT_Pos)

#define SCB_CPUID_ARCHITECTURE_Pos         16                                         /* Bits 19:16 ARCHITECTURE Position */
#define SCB_CPUID_ARCHITECTURE_Msk         ((uint32_t) 0x000f << SCB_CPUID_ARCHITECTURE_Pos)

#define SCB_CPUID_PARTNO_Pos                4                                         /* Bits 15:4 PartNo Position */
#define SCB_CPUID_PARTNO_Msk               ((uint32_t) 0x0fff << SCB_CPUID_PARTNO_Pos)

#define SCB_CPUID_REVISION_Pos              0                                         /* Bits 3:0 Revision Position */
#define SCB_CPUID_REVISION_Msk             ((uint32_t) 0x000f << SCB_CPUID_REVISION_Pos)



/* SCB Interrupt Control State Register Definitions */
#define SCB_ICSR_NMIPENDSET_Pos            31                                         /* Bit 31 NMIPENDSET:
                                                                                         NMI set-pending bit position */
#define SCB_ICSR_NMIPENDSET_Msk            ((uint32_t) 0x01 << SCB_ICSR_NMIPENDSET_Pos)

#define SCB_ICSR_PENDSVSET_Pos             28                                         /* Bit 28 PENDSVSET:
                                                                                         PendSV set-pending bit Position */
#define SCB_ICSR_PENDSVSET_Msk             ((uint32_t) 0x01 << SCB_ICSR_PENDSVSET_Pos)

#define SCB_ICSR_PENDSVCLR_Pos             27                                         /* Bit 27 PENDSVCLR:
                                                                                         PendSV clear-pending bit Position */
#define SCB_ICSR_PENDSVCLR_Msk             ((uint32_t) 0x01 << SCB_ICSR_PENDSVCLR_Pos)

#define SCB_ICSR_PENDSTSET_Pos             26                                         /* Bit 26 PENDSTSET:
                                                                                         SysTick exception set-pending bit Position */
#define SCB_ICSR_PENDSTSET_Msk             ((uint32_t) 0x01 << SCB_ICSR_PENDSTSET_Pos)

#define SCB_ICSR_PENDSTCLR_Pos             25                                         /* Bit 25 PENDSTCLR:
                                                                                         SysTick exception clear-pending bit Position */
#define SCB_ICSR_PENDSTCLR_Msk             ((uint32_t) 0x01 << SCB_ICSR_PENDSTCLR_Pos)

