ANSSI-FR/SecAESSTM32/src/stm32discovery_F407/stm32f4xx_scb.h
#define SCB_ICSR_ISRPREEMPT_Pos            23                                         /* Bit 23 ISRPREEMPT:
                                                                                         reserved for Debug use and reads-as-zero when
                                                                                         the processor is not in Debug */
#define SCB_ICSR_ISRPREEMPT_Msk            ((uint32_t) 0x01 << SCB_ICSR_ISRPREEMPT_Pos)

#define SCB_ICSR_ISRPENDING_Pos            22                                         /* Bit 22 ISRPENDING:
                                                                                         Interrupt pending flag, excluding NMI and Faults */
#define SCB_ICSR_ISRPENDING_Msk            ((uint32_t) 0x01 << SCB_ICSR_ISRPENDING_Pos)

#define SCB_ICSR_VECTPENDING_Pos           12                                         /* Bits 18:12 VECTPENDING: Pending vector.
                                                                                         Indicates the exception number of the highest priority
                                                                                         pending enabled exception Position */
#define SCB_ICSR_VECTPENDING_Msk           (0x1FFUL << SCB_ICSR_VECTPENDING_Pos)

#define SCB_ICSR_RETTOBASE_Pos             11                                         /* Bit 11 RETTOBASE: Return to base level.
                                                                                         Indicates whether there are preempted active                                                                                                                          exceptions Position */
#define SCB_ICSR_RETTOBASE_Msk             ((uint32_t) 0x01 << SCB_ICSR_RETTOBASE_Pos)

#define SCB_ICSR_VECTACTIVE_Pos             0                                         /* Bits 8:0 VECTACTIVE Active vector.
                                                                                         Contains the active exception number Position */
#define SCB_ICSR_VECTACTIVE_Msk            ((uint32_t) 0x1FF << SCB_ICSR_VECTACTIVE_Pos)



/* SCB Vector Table Offset Register Definitions */
#define SCB_VTOR_TBLOFF_Pos                9                                         /* Bits 29:9 TBLOFF: Vector table base offset field */
#define SCB_VTOR_TBLOFF_Msk                ((uint32_t) 0x1fffff << SCB_VTOR_TBLOFF_Pos)


/* SCB Application Interrupt and Reset Control Register Definitions */
#define SCB_AIRCR_VECTKEY_Pos              16                                         /* Bits 31:16 VECTKEYSTAT/ VECTKEY Register key */
#define SCB_AIRCR_VECTKEY_Msk              ((uint32_t) 0xFFFF << SCB_AIRCR_VECTKEY_Pos)

#define SCB_AIRCR_ENDIANESS_Pos            15                                         /* Bit 15 ENDIANESS Data endianness bit */
#define SCB_AIRCR_ENDIANESS_Msk            ((uint32_t) 0x01 << SCB_AIRCR_ENDIANESS_Pos)

#define SCB_AIRCR_PRIGROUP_Pos              8                                         /* Bits 10:8 PRIGROUP: Interrupt priority grouping field  */
#define SCB_AIRCR_PRIGROUP_Msk             ((uint32_t) 0x07 << SCB_AIRCR_PRIGROUP_Pos)

#define SCB_AIRCR_SYSRESETREQ_Pos           2                                         /* Bit 2 SYSRESETREQ System reset request */
#define SCB_AIRCR_SYSRESETREQ_Msk          ((uint32_t) 0x01 << SCB_AIRCR_SYSRESETREQ_Pos)

#define SCB_AIRCR_VECTCLRACTIVE_Pos         1                                         /* Bit 1 VECTCLRACTIVE Reserved for Debug use.
                                                                                        This bit reads as 0.
                                                                                        When writing to the register you must write 0 to
                                                                                        this bit, otherwise behavior is unpredictable. */
#define SCB_AIRCR_VECTCLRACTIVE_Msk        ((uint32_t) 0x01 << SCB_AIRCR_VECTCLRACTIVE_Pos)

#define SCB_AIRCR_VECTRESET_Pos             0                                         /* Bit 0 VECTRESET
                                                                                         Reserved for Debug use.
                                                                                         This bit reads as 0.
                                                                                         When writing to the register you must write 0 to
                                                                                         this bit, otherwise behavior is unpredictable. */
#define SCB_AIRCR_VECTRESET_Msk            ((uint32_t) 0x01 << SCB_AIRCR_VECTRESET_Pos)


/* SCB System Control Register Definitions */
#define SCB_SCR_SEVONPEND_Pos               4                                         /* Bit 4 SEVEONPEND Send Event on Pending bit */
#define SCB_SCR_SEVONPEND_Msk              ((uint32_t) 0x01 << SCB_SCR_SEVONPEND_Pos)

#define SCB_SCR_SLEEPDEEP_Pos               2                                         /* Bit 2 SLEEPDEEP  */
#define SCB_SCR_SLEEPDEEP_Msk              ((uint32_t) 0x01 << SCB_SCR_SLEEPDEEP_Pos)

#define SCB_SCR_SLEEPONEXIT_Pos             1                                         /* Bit 1 SLEEPONEXIT  */
#define SCB_SCR_SLEEPONEXIT_Msk            ((uint32_t) 0x01 << SCB_SCR_SLEEPONEXIT_Pos)


/* SCB Configuration Control Register Definitions */
#define SCB_CCR_STKALIGN_Pos                9                                         /* Bit 9 STKALIGN */
#define SCB_CCR_STKALIGN_Msk               ((uint32_t) 0x01 << SCB_CCR_STKALIGN_Pos)

#define SCB_CCR_BFHFNMIGN_Pos               8                                         /* Bit 8 BFHFNMIGN */
#define SCB_CCR_BFHFNMIGN_Msk              ((uint32_t) 0x01 << SCB_CCR_BFHFNMIGN_Pos)

#define SCB_CCR_DIV_0_TRP_Pos               4                                         /* Bit 4 DIV_0_TRP */
#define SCB_CCR_DIV_0_TRP_Msk              ((uint32_t) 0x01 << SCB_CCR_DIV_0_TRP_Pos)

#define SCB_CCR_UNALIGN_TRP_Pos             3                                         /* Bit 3 UNALIGN_ TRP */
#define SCB_CCR_UNALIGN_TRP_Msk            ((uint32_t) 0x01 << SCB_CCR_UNALIGN_TRP_Pos)

