ANSSI-FR/SecAESSTM32/src/stm32discovery_F407/stm32f4xx_scb.h
#define SCB_CCR_USERSETMPEND_Pos            1                                         /* Bit 1 USERSETMPEND */
#define SCB_CCR_USERSETMPEND_Msk           ((uint32_t) 0x01 << SCB_CCR_USERSETMPEND_Pos)

#define SCB_CCR_NONBASETHRDENA_Pos          0                                         /* Bit 0 NONBASETHRDENA */
#define SCB_CCR_NONBASETHRDENA_Msk         ((uint32_t) 0x01 << SCB_CCR_NONBASETHRDENA_Pos)


//System handler priority register 1 (SHPR1)
#define SCB_SHPR1_PRI_4_Pos                 0                                         /* Bits 7:0 PRI_4:
                                                                                         Priority of system handler 4,
                                                                                         memory management fault */
#define SCB_SHPR1_PRI_4_Msk                 ((uint32_t) 0xff << SCB_SHPR1_PRI_4_Pos)

#define SCB_SHPR1_PRI_5_Pos                 8                                         /* Bits 15:8 PRI_5:
                                                                                         Priority of system handler 5, bus fault */
#define SCB_SHPR1_PRI_5_Msk                 ((uint32_t) 0xff << SCB_SHPR1_PRI_5_Pos)



//System handler priority register 2 (SHPR2)
#define SCB_SHPR2_PRI_6_Pos                 16                                        /* Bits 23:16 PRI_6:
                                                                                         Priority of system handler 6, usage fault */
#define SCB_SHPR2_PRI_6_Msk                 ((uint32_t) 0xff << SCB_SHPR2_PRI_6_Pos)
#define SCB_SHPR2_PRI_11_Pos                 24                                       /* Bits 31:24 PRI_11:
                                                                                         Priority of system handler 11, SVCall */
#define SCB_SHPR2_PRI_11_Msk                ((uint32_t) 0xff << SCB_SHPR2_PRI_11_Pos)



//System handler priority register 3 (SHPR3)
#define SCB_SHPR3_PRI_14_Pos                16                                        /* Bits 23:16 PRI_14:
                                                                                         Priority of system handler 14, PendSV */
#define SCB_SHPR3_PRI_14_Msk                ((uint32_t) 0xff << SCB_SHPR3_PRI_14_Pos)
#define SCB_SHPR3_PRI_15_Pos                24                                        /* Bits 31:24 PRI_15:
                                                                                         Priority of system handler 15, SysTick exception */
#define SCB_SHPR3_PRI_15_Msk                ((uint32_t) 0xff << SCB_SHPR3_PRI_15_Pos)


/* SCB System Handler Control and State Register Definitions */
#define SCB_SHCSR_USGFAULTENA_Pos          18                                         /* Bit 18 USGFAULTENA:
                                                                                         Usage fault enable bit, set to 1 to enable */
#define SCB_SHCSR_USGFAULTENA_Msk          ((uint32_t) 0x01 << SCB_SHCSR_USGFAULTENA_Pos)

#define SCB_SHCSR_BUSFAULTENA_Pos          17                                         /* Bit 17 BUSFAULTENA:
                                                                                         Bus fault enable bit, set to 1 to enabl */
#define SCB_SHCSR_BUSFAULTENA_Msk          ((uint32_t) 0x01 << SCB_SHCSR_BUSFAULTENA_Pos)

#define SCB_SHCSR_MEMFAULTENA_Pos          16                                         /* Bit 16 MEMFAULTENA:
                                                                                         Memory management fault enable bit,
                                                                                         set to 1 to enable */
#define SCB_SHCSR_MEMFAULTENA_Msk          ((uint32_t) 0x01 << SCB_SHCSR_MEMFAULTENA_Pos)

#define SCB_SHCSR_SVCALLPENDED_Pos         15                                         /* Bit 15 SVCALLPENDED:
                                                                                         SVC call pending bit,
                                                                                         reads as 1 if exception is pending */
#define SCB_SHCSR_SVCALLPENDED_Msk         ((uint32_t) 0x01 << SCB_SHCSR_SVCALLPENDED_Pos)

#define SCB_SHCSR_BUSFAULTPENDED_Pos       14                                         /* Bit 14 BUSFAULTPENDED:
                                                                                         Bus fault exception pending bit,
                                                                                         reads as 1 if exception is pending */
#define SCB_SHCSR_BUSFAULTPENDED_Msk       ((uint32_t) 0x01 << SCB_SHCSR_BUSFAULTPENDED_Pos)

#define SCB_SHCSR_MEMFAULTPENDED_Pos       13                                         /* Bit 13 MEMFAULTPENDED:
                                                                                         Memory management fault exception pending bit,
                                                                                         reads as 1 if exception is pending */
#define SCB_SHCSR_MEMFAULTPENDED_Msk       ((uint32_t) 0x01 << SCB_SHCSR_MEMFAULTPENDED_Pos)

#define SCB_SHCSR_USGFAULTPENDED_Pos       12                                         /* Bit 12 USGFAULTPENDED:
                                                                                         Usage fault exception pending bit,
                                                                                         reads as 1 if exception is pending */
#define SCB_SHCSR_USGFAULTPENDED_Msk       ((uint32_t) 0x01 << SCB_SHCSR_USGFAULTPENDED_Pos)

#define SCB_SHCSR_SYSTICKACT_Pos           11                                         /* Bit 11 SYSTICKACT:
                                                                                         SysTick exception active bit,
                                                                                         reads as 1 if exception is active */
#define SCB_SHCSR_SYSTICKACT_Msk           ((uint32_t) 0x01 << SCB_SHCSR_SYSTICKACT_Pos)

#define SCB_SHCSR_PENDSVACT_Pos            10                                         /* Bit 10 PENDSVACT:
                                                                                         PendSV exception active bit,
                                                                                         reads as 1 if exception is activen */
#define SCB_SHCSR_PENDSVACT_Msk            ((uint32_t) 0x01 << SCB_SHCSR_PENDSVACT_Pos)

#define SCB_SHCSR_MONITORACT_Pos            8                                         /* Bit 8 MONITORACT:
                                                                                         Debug monitor active bit,
                                                                                         reads as 1 if Debug monitor is active */
#define SCB_SHCSR_MONITORACT_Msk           ((uint32_t) 0x01 << SCB_SHCSR_MONITORACT_Pos)

#define SCB_SHCSR_SVCALLACT_Pos             7                                         /* Bit 7 SVCALLACT:
                                                                                         SVC call active bit,
                                                                                         reads as 1 if SVC call is active */
#define SCB_SHCSR_SVCALLACT_Msk            ((uint32_t) 0x01 << SCB_SHCSR_SVCALLACT_Pos)

