ANSSI-FR/SecAESSTM32/src/stm32discovery_F407/stm32f4xx_scb.h
#define SCB_SHCSR_USGFAULTACT_Pos           3                                         /* Bit 3 USGFAULTACT:
                                                                                         Usage fault exception active bit,
                                                                                         reads as 1 if exception is active */
#define SCB_SHCSR_USGFAULTACT_Msk          ((uint32_t) 0x01 << SCB_SHCSR_USGFAULTACT_Pos)

#define SCB_SHCSR_BUSFAULTACT_Pos           1                                         /* Bit 1 BUSFAULTACT:
                                                                                         Bus fault exception active bit,
                                                                                         reads as 1 if exception is active */
#define SCB_SHCSR_BUSFAULTACT_Msk          ((uint32_t) 0x01 << SCB_SHCSR_BUSFAULTACT_Pos)

#define SCB_SHCSR_MEMFAULTACT_Pos           0                                         /* Bit 0 MEMFAULTACT:
                                                                                         Memory management fault exception active bit,
                                                                                         reads as 1 if exception is active */
#define SCB_SHCSR_MEMFAULTACT_Msk          ((uint32_t) 0x01 << SCB_SHCSR_MEMFAULTACT_Pos)

/* Configurable fault status register (CFSR; UFSR+BFSR+MMFSR)
 * The CFSR is byte accessible. You can access the CFSR or its subregisters as follows:
 * • Access the complete CFSR with a word access to 0xE000ED28
 * • Access the MMFSR with a byte access to 0xE000ED28
 * • Access the MMFSR and BFSR with a halfword access to 0xE000ED28
 * • Access the BFSR with a byte access to 0xE000ED29
 * • Access the UFSR with a halfword access to 0xE000ED2A.
 *
 * The CFSR indicates the cause of a memory management fault, bus fault, or usage fault.
 */

#define SCB_CFSR_UFSR_Pos                       16                                      /* Bits 31:16 UFSR:
                                                                                           Usage fault status register (UFSR) */
#define SCB_CFSR_UFSR_Msk                       ((uint32_t) 0xffff << SCB_CFSR_UFSR_Pos)
#define SCB_CFSR_BFSR_Pos                       8                                       /* Bits 15:8 BFSR:
                                                                                           Bus fault status register (BFSR) */
#define SCB_CFSR_BFSR_Msk                       ((uint32_t) 0xff << SCB_CFSR_BFSR_Pos)
#define SCB_CFSR_MMFSR_Pos                      0                                       /* Bits 7:0 MMFSR:
                                                                                           Memory management fault address register (MMFSR) */
#define SCB_CFSR_MMFSR_Msk                      ((uint32_t) 0xff << SCB_CFSR_MMFSR_Pos)


 /* Usage fault status register (UFSR) */
#define SCB_CFSR_UFSR_DIVBYZERO_Pos              25                                    /* Bit 25 DIVBYZERO:
                                                                                          Divide by zero usage fault. */
#define SCB_CFSR_UFSR_DIVBYZERO_Msk              ((uint32_t) 0x01 << SCB_UFSR_DIVBYZERO_Pos)
#define SCB_CFSR_UFSR_UNALIGNED_Pos              24                                    /* Bit 24 UNALIGNED:
                                                                                          Unaligned access usage fault. */
#define SCB_CFSR_UFSR_UNALIGNED_Msk              ((uint32_t) 0x01 << SCB_UFSR_UNALIGNED_Pos)
#define SCB_CFSR_UFSR_NOCP_Pos                   19                                    /* Bit 19 NOCP:
                                                                                          No coprocessor usage fault. */
#define SCB_CFSR_UFSR_NOCP_Msk                   ((uint32_t) 0x01 << SCB_UFSR_NOCP_Pos)
#define SCB_CFSR_UFSR_INVPC_Pos                  18                                    /* Bit 18 INVPC:
                                                                                          Invalid PC load usage fault,
                                                                                          caused by an invalid PC load by EXC_RETURN */
#define SCB_CFSR_UFSR_INVPC_Msk                  ((uint32_t) 0x01 << SCB_UFSR_INVPC_Pos)
#define SCB_CFSR_UFSR_INVSTATE_Pos               17                                    /* Bit 17 INVSTATE:
                                                                                          Invalid state usage fault. */
#define SCB_CFSR_UFSR_INVSTATE_Msk               ((uint32_t) 0x01 << SCB_UFSR_INVSTATE_Pos)
#define SCB_CFSR_UFSR_UNDEFINSTR_Pos             16                                     /* Bit 16 UNDEFINSTR:
                                                                                           Undefined instruction usage fault. */
#define SCB_CFSR_UFSR_UNDEFINSTR_Msk             ((uint32_t) 0x01 << SCB_UFSR_UNDEFINSTR_Pos)

/* Bus fault status register (BFSR) */
#define SCB_CFSR_BFSR_BFARVALID_Pos              15                                     /* Bit 15 BFARVALID:
                                                                                           Bus Fault Address Register (BFAR) valid flag.
                                                                                           The processor sets this bit to 1*/
#define SCB_CFSR_BFSR_BFARVALID_Msk              ((uint32_t) 0x01 << SCB_BFSR_BFARVALID_Pos)
#define SCB_CFSR_BFSR_LSPERR_Pos                 13                                     /* Bit 13 LSPERR:
                                                                                           Bus fault on floating-point lazy state preservation. */
#define SCB_CFSR_BFSR_LSPERR_Msk                 ((uint32_t) 0x01 << SCB_BFSR_LSPERR_Pos)
#define SCB_CFSR_BFSR_STKERR_Pos                 12                                     /* Bit 12 STKERR:
                                                                                           Bus fault on stacking for exception entry. */
#define SCB_CFSR_BFSR_STKERR_Msk                 ((uint32_t) 0x01 << SCB_BFSR_STKERR_Pos)
#define SCB_CFSR_BFSR_UNSTKERR_Pos               11                                     /* Bit 11 UNSTKERR:
                                                                                           Bus fault on unstacking for a return from exception. */
#define SCB_CFSR_BFSR_UNSTKERR_Msk               ((uint32_t) 0x01 << SCB_BFSR_UNSTKERR_Pos)
#define SCB_CFSR_BFSR_IMPRECISERR_Pos            10                                     /* Bit 10 IMPRECISERR:
                                                                                           Imprecise data bus error. */
#define SCB_CFSR_BFSR_IMPRECISERR_Msk            ((uint32_t) 0x01 << SCB_BFSR_IMPRECISERR_Pos)
#define SCB_CFSR_BFSR_PRECISERR_Pos              9                                      /* Bit 9 PRECISERR:
                                                                                           Precise data bus error. */
#define SCB_CFSR_BFSR_PRECISERR_Msk              ((uint32_t) 0x01 << SCB_BFSR_PRECISERR_Pos)
#define SCB_CFSR_BFSR_IBUSERR_Pos                8                                      /* Bit 8 IBUSERR:
                                                                                           Instruction bus error. */
#define SCB_CFSR_BFSR_IBUSERR_Msk                ((uint32_t) 0x01 << SCB_BFSR_IBUSERR_Pos)

/* Memory management fault address register (MMFSR)*/
#define SCB_CFSR_MMFSR_MMARVALID_Pos             7                                      /* Bit 7 MMARVALID:
                                                                                           Memory Management Fault Address Register (MMAR) valid flag. */
#define SCB_CFSR_MMFSR_MMARVALID_Msk             ((uint32_t) 0x01 << SCB_MMFSR_MMARVALID_Pos)
#define SCB_CFSR_MMFSR_MLSPERR_Pos               5                                      /* Bit 5 MLSPERR:
                                                                                           MemManage fault  status */
#define SCB_CFSR_MMFSR_MLSPERR_Msk               ((uint32_t) 0x01 << SCB_MMFSR_MLSPERR_Pos)
#define SCB_CFSR_MMFSR_MSTKERR_Pos               4                                      /* Bit 4 MSTKERR:
                                                                                           Memory manager fault on stacking for exception entry. */
#define SCB_CFSR_MMFSR_MSTKERR_Msk               ((uint32_t) 0x01 << SCB_MMFSR_MSTKERR_Pos)
#define SCB_CFSR_MMFSR_MUNSTKERR_Pos             3                                      /* Bit 3 MUNSTKERR:
                                                                                           Memory manager fault on unstacking
                                                                                           for a return from exception. */
#define SCB_CFSR_MMFSR_MUNSTKERR_Msk             ((uint32_t) 0x01 << SCB_MMFSR_MUNSTKERR_Pos)
#define SCB_CFSR_MMFSR_DACCVIOL_Pos              1                                      /* Bit 1 DACCVIOL:
                                                                                           Data access violation flag. */
#define SCB_CFSR_MMFSR_DACCVIOL_Msk              ((uint32_t) 0x01 << SCB_MMFSR_DACCVIOL_Pos)

#define SCB_CFSR_MMFSR_IACCVIOL_Pos              0                                      /* Bit 0 IACCVIOL:
                                                                                           Instruction access violation flag.
                                                                                           This fault occurs on any access to an XN region */
#define SCB_CFSR_MMFSR_IACCVIOL_Msk              ((uint32_t) 0x01 << SCB_MMFSR_Pos)

/* Hard fault status register (HFSR)*/
#define SCB_HFSR_DEBUG_VT_Pos                   31                                      /*  Bit 31 DEBUG_VT:
                                                                                            Reserved for Debug use.
                                                                                            When writing to the register you must write 0 to this bit*/
#define SCB_HFSR_DEBUG_VT_Msk              ((uint32_t) 0x01 << SCB_HFSR_DEBUG_VT_Pos)

#define SCB_HFSR_FORCED_Pos                30                                           /*  Bit 30 FORCED:
                                                                                            Forced hard fault.
                                                                                            Indicates a forced hard fault,
                                                                                            generated by escalation of a fault */
#define SCB_HFSR_FORCED_Msk                ((uint32_t) 0x01 << SCB_HFSR_FORCED_Pos)

#define SCB_HFSR_VECTTBL_Pos               1                                            /*  Bit 1 VECTTBL:
                                                                                            Vector table hard fault.
                                                                                            Indicates a bus fault on a vector table read during */
#define SCB_HFSR_VECTTBL_Msk               ((uint32_t) 0x01 << SCB_HFSR_VECTTBL_Pos)

