ANSSI-FR/SecAESSTM32/src/stm32discovery_F407/stm32f4xx_scb.h
/* Memory management fault address register (MMFAR) */
#define SCB_MMFAR_Pos                       0                                           /* Bits 31:0 MMFAR: Memory management fault address */
#define SCB_MMFAR_Msk                       ((uint32_t) 0xffffffff << SCB_MMFAR_Pos)

/* Bus fault address register (BFAR) */
#define SCB_BFAR_Pos                        0                                           /* Bits 31:0 Bus fault address
                                                                                           When the BFARVALID bit of the BFSR is set to 1,
                                                                                           this field holds the address f the location that
                                                                                           generated the bus fault. When an unaligned access faults
                                                                                           the address in the BFAR is the one requested by the instruction,
                                                                                           even if it is not the adress of the fault. */
#define SCB_BFAR_Msk                        ((uint32_t) 0xffffffff << SCB_BFAR_Pos)

/* Auxiliary fault status register (AFSR) */
#define SCB_AFSR_IMPDEF_Pos                  0                                          /* Bits 31:0 IMPDEF:
                                                                                           Implementation defined.
                                                                                           The AFSR contains additional system fault information. */
#define SCB_AFSR_IMPDEF_Msk                  ((uint32_t) 0xffffffff << SCB_AFSR_IMPDEF_Pos)
#endif /* _STM32F4XX_SCB_H */
